===========================
Entities Definition Empty
===========================

entity Base{
}

---

(source_file
  (entity
    (identifier)))

===========================
Entities Definition Values
===========================

entity Food{
    field x: Int;
	field z: Nat;
	field y: CString;
	field a: BigNat;
}

---

(source_file
  (entity
    (identifier)
    (field
      (variable_expression
        (identifier)
        (primitive_type)))
    (field
      (variable_expression
        (identifier)
        (primitive_type)))
    (field
      (variable_expression
        (identifier)
        (primitive_type)))
    (field
      (variable_expression
        (identifier)
        (primitive_type)))))

===========================
Entities Accesors Use
===========================

public function main(f: Foo): Int { 
    let k = f.x + f.y;
    assert k > f.x;

    return k;
}

---

(source_file
  (function_definition
    (function_modifier)
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters
        (variable_expression
          (identifier)
          (identifier)))
      (function_return_parameters
        (primitive_type))
      (function_body
        (variable_statement
          (variable_expression
            (identifier)
            (access_expression
              (identifier)
              (access_expression
                (binary_expression
                  (identifier)
                  (identifier))
                (identifier)))))
        (assert_statement
          (access_expression
            (binary_expression
              (identifier)
              (identifier))
            (identifier)))
        (return_statement
          (identifier))))))

===========================
Entities Accesors Use Alt
===========================
entity Foo {
	field f: Int; 
} 

function foo(): Foo {
	return Foo{1i}; 
}


---

(source_file
  (entity
    (identifier)
    (field
      (variable_expression
        (identifier)
        (primitive_type))))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (identifier))
      (function_body
        (return_statement
          (type_definition
            (identifier)
            (num_whole)))))))

===========================
Entities Field Update
===========================

entity Foo{
	field x: Int; 
} 

function main(): Int {
	var v = Foo{1i};
	return v[x = 2i].x;
}

----

(source_file
  (entity
    (identifier)
    (field
      (identifier)
      (primitive_type)))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (variable_statement
          (variable_expression
            (variable_definition
              (identifier))
            (type_definition
              (identifier)
              (num_whole))))
        (return_statement
          (access_expression
            (entity_update
              (identifier)
              (variable_redefinition
                (variable_definition
                  (identifier)))
              (num_whole))
            (identifier)))))))

===========================
Entities Field Update Alt
===========================

entity Foo{
	field x: Int; 
} 

function main(): Int {
	var v = Foo{1i};
	return v[x = $x + 1i].x;
}

----

(source_file
  (entity
    (identifier)
    (field
      (identifier)
      (primitive_type)))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (variable_statement
          (variable_expression
            (variable_definition
              (identifier))
            (type_definition
              (identifier)
              (num_whole))))
        (return_statement
          (access_expression
            (entity_update
              (identifier)
              (variable_redefinition
                (variable_definition
                  (identifier)))
              (binary_expression
                (identifier
                  (modifier))
                (num_whole)))
            (identifier)))))))
