=======================================
eADT Decl 1
=======================================

datatype Foo using {
	field f: Int;
} of F1 { } | F2 { };

function main(): Int {
	return F1{3i}.f;
}

---

(source_file
  (datatype
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))))
    (identifier)
    (identifier))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
eADT Decl 2
=======================================

datatype Foo using {
	field f: Int;
	invariant $f >= 0i;
} of F1 { } | F2 {
	field g: Bool;
};

function main(): Bool {
	return F2{3i, false}.g;
}

---

(source_file
  (datatype
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))))
    (field
      (invariant
        (binary_expression
          (identifier
            (modifier))
          (num_whole))))
    (identifier)
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type)))))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole)
              (false_lit))
            (identifier)))))))

=======================================
eADT Decl 3
=======================================

datatype Foo<T> using {
	field f: T;
} of F1 { } | F2 { };

function main(): Int {
	return F1<Int>{3i}.f;
}

---

(source_file
  (datatype
    (identifier)
    (identifier)
    (field
      (identifier)
      (identifier))
    (identifier)
    (identifier))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (entity_access
            (entity_definition
              (identifier)
              (identifier)
              (num_whole)))
          (identifier))))))

=======================================
eADT Decl 4
=======================================

concept Bar<U> {
	field f: U;
}

datatype Foo provides Bar<Int> using {
	field g: Bool;
} of F1 {
	invariant $g ==> $f >= 0i;
} | F2 { };

function main(): Int {
	return F1<Int>{3i, true}.f;
}

---

(source_file
  (concept
    (identifier)
    (identifier)
    (field
      (identifier)
      (identifier)))
  (datatype
    (identifier)
    (identifier)
    (identifier)
    (field
      (identifier)
      (primitive_type))
    (identifier)
    (field
      (invariant
        (binary_expression
          (binary_expression
            (identifier
              (modifier))
            (identifier
              (modifier)))
          (num_whole))))
    (identifier))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (entity_access
            (entity_definition
              (identifier)
              (identifier)
              (num_whole)
              (true_lit)))
          (identifier))))))

=======================================
eADT Basic 1
=======================================

datatype Foo of
	F1 { field f: Int; } |
	F2 { };

function main(): Int {
	return F1{3i}.f;
}

---

(source_file
  (datatype
    (identifier)
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))))
    (identifier))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
eADT Basic 2
=======================================

datatype Foo of
	F1 { field f: Int; invariant $f >= 0i; } |
	F2 { field g: Bool; };

function main(): Bool {
	return F2{false}.g;
}

---

(source_file
  (datatype
    (identifier)
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))))
    (field
      (invariant
        (binary_expression
          (identifier
            (modifier))
          (num_whole))))
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type)))))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (false_lit))
            (identifier)))))))

=======================================
eADT Basic 3 (Generic)
=======================================

datatype Foo<T> of
	F1 { field f: T; } |
	F2 { };

function main(): Int {
	return Foo<Int>{3i}.f;
}

---

(source_file
  (datatype
    (identifier)
    (identifier)
    (identifier)
    (field
      (identifier)
      (identifier))
    (identifier))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (entity_access
            (entity_definition
              (identifier)
              (identifier)
              (num_whole)))
          (identifier))))))

=======================================
eADT Const 1
=======================================

datatype Foo of
	F1 { field f: Int; } |
	F2 { } & {
		const c: Int = 3i;
	};

function main(): Int {
	return F1::c;
}

---

(source_file
  (datatype
    (identifier)
    (identifier)
    (field
      (identifier)
      (primitive_type))
    (identifier)
    (field
      (const_decl
        (variable_definition
          (identifier)
          (primitive_type))
        (num_whole))))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (import
            (identifier)
            (identifier)))))))

=======================================
eADT Const 2
=======================================

datatype Foo of
	F1 { field f: Int; } |
	F2 { } & {
		const c: Int = 3i;
	};

function main(): Int {
	return Foo::c;
}

---

(source_file
  (datatype
    (identifier)
    (identifier)
    (field
      (identifier)
      (primitive_type))
    (identifier)
    (field
      (const_decl
        (variable_definition
          (identifier)
          (primitive_type))
        (num_whole))))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (import
            (identifier)
            (identifier)))))))

=======================================
eADT Function 1
=======================================

datatype Foo of
	F1 { field f: Int; } |
	F2 { } & {
		function foo(): Int { return 3i; }
	};

function main(): Int {
	return F1::foo();
}

---

(source_file
  (datatype
    (object_id
      (entity_id))
    (entity_id)
    (identifier)
    (entity_id)
    (entity_id)
    (function_definition
      (object_id
        (entity_id))
      (function_parameters)
      (function_return_parameters
        (entity_id))
      (function_body
        (return_statement
          (num_whole)))))
  (function_definition
    (object_id
      (entity_id))
    (function_parameters)
    (function_return_parameters
      (entity_id))
    (function_body
      (return_statement
        (import
          (entity_id)
          (function_call
            (identifier)))))))

=======================================
eADT Function 2
=======================================

datatype Foo of
	F1 { field f: Int; } |
	F2 { } & {
		function foo(): Int { return 3i; }
	};

function main(): Int {
	return Foo::foo();
}

---

(source_file
  (datatype
    (object_id
      (entity_id))
    (entity_id)
    (identifier)
    (entity_id)
    (entity_id)
    (function_definition
      (object_id
        (entity_id))
      (function_parameters)
      (function_return_parameters
        (entity_id))
      (function_body
        (return_statement
          (num_whole)))))
  (function_definition
    (object_id
      (entity_id))
    (function_parameters)
    (function_return_parameters
      (entity_id))
    (function_body
      (return_statement
        (import
          (entity_id)
          (function_call
            (identifier)))))))

=======================================
Entity Inherit Fields 1
=======================================

concept Foo {
	field f: Int;
}
entity Bar provides Foo { }

function main(): Int {
	return Bar{3i}.f;
}

---

(source_file
  (concept
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type)))))
  (entity
    (identifier)
    (identifier))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
Entity Inherit Fields 2
=======================================

concept Foo {
	field f: Int;
}
entity Bar provides Foo {
	field g: Bool;
}

function main(): Bool {
	return Bar{3i, true}.g;
}

---

(source_file
  (concept
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type)))))
  (entity
    (identifier)
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type)))))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole)
              (true_lit))
            (identifier)))))))

=======================================
Entity Inherit Fields 3 (Multi Concept)
=======================================

concept Foo {
	field f: Int;
}
concept Baz {
	field g: Bool;
}
entity Bar provides Foo, Baz { }

function main(): Int {
	return Bar{3i, true}.f;
}

---

(source_file
  (concept
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type)))))
  (concept
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type)))))
  (entity
    (identifier)
    (identifier)
    (identifier))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole)
              (true_lit))
            (identifier)))))))

=======================================
Entity Inherit Generic 1
=======================================

concept Foo<T> {
	field f: T;
}
entity Bar<T> provides Foo<T> { }

function main(): Int {
	return Bar<Int>{3i}.f;
}

---

(source_file
  (concept
    (identifier)
    (identifier)
    (field
      (identifier)
      (identifier)))
  (entity
    (identifier)
    (identifier)
    (identifier)
    (identifier))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (entity_access
            (entity_definition
              (identifier)
              (identifier)
              (num_whole)))
          (identifier))))))

=======================================
Entity Inherit Generic 2 (Renamed Param)
=======================================

concept Foo<U> {
	field f: U;
}
entity Bar<T> provides Foo<T> { }

function main(): Int {
	return Bar<Int>{3i}.f;
}

---

(source_file
  (concept
    (identifier)
    (identifier)
    (field
      (identifier)
      (identifier)))
  (entity
    (identifier)
    (identifier)
    (identifier)
    (identifier))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (entity_access
            (entity_definition
              (identifier)
              (identifier)
              (num_whole)))
          (identifier))))))

=======================================
Entity Inherit Invariants 1
=======================================

concept Foo {
	field f: Int;
	invariant $f > 0i;
}
entity Bar provides Foo { }

function main(): Int {
	return Bar{3i}.f;
}

---

(source_file
  (concept
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))))
    (field
      (invariant
        (binary_expression
          (identifier
            (modifier))
          (num_whole)))))
  (entity
    (identifier)
    (identifier))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
Entity Inherit Invariants 2 (Override)
=======================================

concept Foo {
	field f: Int;
}
entity Bar provides Foo {
	invariant $f > 0i;
}

function main(): Int {
	return Bar{3i}.f;
}

---

(source_file
  (concept
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type)))))
  (entity
    (identifier)
    (identifier)
    (field
      (invariant
        (binary_expression
          (identifier
            (modifier))
          (num_whole)))))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
Entity Inherit Invariants 3 (Composed)
=======================================

concept Foo {
	field f: Int;
	invariant $f != 0i;
}
entity Bar provides Foo {
	invariant $f > 0i;
}

function main(): Int {
	return Bar{3i}.f;
}

---

(source_file
  (concept
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))))
    (field
      (invariant
        (binary_expression
          (identifier
            (modifier))
          (num_whole)))))
  (entity
    (identifier)
    (identifier)
    (field
      (invariant
        (binary_expression
          (identifier
            (modifier))
          (num_whole)))))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
Entity Decl 1
=======================================

entity Foo {
	field f: Int;
}

function main(): Int {
	return Foo{3i}.f;
}

---

(source_file
  (entity
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type)))))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
Entity Decl 2
=======================================

entity Foo {
	field f: Int;
	invariant $f >= 0i;
}

function main(): Int {
	return Foo{3i}.f;
}

---

(source_file
  (entity
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))))
    (field
      (invariant
        (binary_expression
          (identifier
            (modifier))
          (num_whole)))))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
Entity Decl 3
=======================================

entity Foo<T> {
	field f: T;
}

function main(): Int {
	return Foo<Int>{3i}.f;
}

---

(source_file
  (entity
    (identifier)
    (identifier)
    (field
      (identifier)
      (identifier)))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (entity_access
            (entity_definition
              (identifier)
              (identifier)
              (num_whole)))
          (identifier))))))

=======================================
Entity Default Fields 1
=======================================

entity Foo {
	field f: Int = 3i;
}

function main(): Int {
	return Foo{3i}.f;
}

---

(source_file
  (entity
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))
        (variable_assignment
          (num_whole)))))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
Entity Default Fields 2
=======================================

entity Foo {
	field f: Int;
	field g: Int = $f;
}

function main(): Int {
	return Foo{3i}.g;
}

---

(source_file
  (entity
    (identifier)
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))))
    (field
      (variable_expression
        (variable_signature
          (identifier)
          (primitive_type))
        (variable_assignment
          (identifier
            (modifier))))))
  (function_definition
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (access_expression
            (type_definition
              (identifier)
              (num_whole))
            (identifier)))))))

=======================================
Entity Consts 1
=======================================

entity Foo {
	const c: Int = 3i;
}

function main(): Int {
	return Foo::c;
}

---

(source_file
  (entity
    (identifier)
    (field
      (const_decl
        (variable_definition
          (identifier)
          (primitive_type))
        (num_whole))))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (import
            (identifier)
            (identifier)))))))

=======================================
Entity Consts 2
=======================================

entity Foo<T> {
	const c: Int = 3i;
}

function main(): Int {
	return Foo::c;
}

---

(source_file
  (entity
    (identifier)
    (identifier)
    (field
      (const_decl
        (variable_definition
          (identifier)
          (primitive_type))
        (num_whole))))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (import
            (identifier)
            (identifier)))))))

=======================================
Entity Functions 1
=======================================

entity Foo {
	function foo(): Int {
		return 3i;
	}
}

function main(): Int {
	return Foo::foo();
}

---

(source_file
  (entity
    (entity_id)
    (function_definition
      (object_id
        (entity_id))
      (function_parameters)
      (function_return_parameters
        (entity_id))
      (function_body
        (return_statement
          (num_whole)))))
  (function_definition
    (object_id
      (entity_id))
    (function_parameters)
    (function_return_parameters
      (entity_id))
    (function_body
      (return_statement
        (import
          (entity_id)
          (function_call
            (identifier)))))))

=======================================
Entity Functions 2
=======================================

entity Foo<T> {
	function foo(x: T): T {
		return x;
	}
}

function main(): Int {
	return Foo<Int>::foo(3i);
}

---

(source_file
  (entity
    (identifier)
    (identifier)
    (field
      (function_definition
        (function_modifier)
        (function_signature
          (identifier)
          (function_parameters
            (function_param_signature
              (identifier)
              (identifier)))
          (function_return_parameters
            (identifier))
          (function_body
            (return_statement
              (identifier)))))))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (import
            (identifier)
            (identifier)
            (identifier))
          (parenthesized_expression
            (num_whole)))))))

=======================================
Entity Functions 3
=======================================

entity Foo {
	function foo<T>(x: T): T {
		return x;
	}
}

function main(): Int {
	return Foo::foo<Int>(3i);
}

---

(source_file
  (entity
    (identifier)
    (field
      (function_definition
        (function_modifier)
        (function_signature
          (identifier)
          (identifier)
          (function_parameters
            (function_param_signature
              (identifier)
              (identifier)))
          (function_return_parameters
            (identifier))
          (function_body
            (return_statement
              (identifier)))))))
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (type_cast_expression
            (import
              (identifier)
              (identifier))
            (primitive_type))
          (parenthesized_expression
            (num_whole)))))))
