=======================================
EList Return 1
=======================================

function main(): (|Int, Bool|) {
	return (|2i, true|);
}

---

(source_file
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (elist_type
          (primitive_type)
          (primitive_type)))
      (function_body
        (return_statement
          (elist
            (num_whole)
            (true_lit)))))))

=======================================
EList Return 2
=======================================

function main(): (|Int, Bool|) {
	return 2i, true;
}

---

(source_file
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (elist_type
          (primitive_type)
          (primitive_type)))
      (function_body
        (return_statement
          (num_whole)
          (true_lit))))))

=======================================
Simple Return 1
=======================================

function main(): Int {
	return 2i;
}

---

(source_file
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_return_parameters
        (primitive_type))
      (function_body
        (return_statement
          (num_whole))))))

=======================================
Simple Return 2
=======================================

function main() {
	return;
}

---

(source_file
  (function_definition
    (function_modifier)
    (function_signature
      (identifier)
      (function_parameters)
      (function_body
        (return_statement)))))
